module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرةً في ملفات الأوامر
	autoUpdateThreadInfo: {},
	checkwarn: {
		text: {
			warn: "العضو %1 تلقّى 3 تحذيرات سابقة وتم حظره من المحادثة\n- الاسم: %1\n- المعرّف: %2\n- لإلغاء الحظر، يرجى استخدام الأمر \"%3warn unban <معرّف>\" (مع استبدال المعرّف بمعرّف الشخص المراد إلغاء حظره)",
			needPermission: "يحتاج البوت إلى صلاحيات المشرف لطرد الأعضاء المحظورين"
		}
	},
	leave: {
		text: {
			session1: "الصباح",
			session2: "الظهر",
			session3: "العصر",
			session4: "المساء",
			leaveType1: "غادر المجموعة",
			leaveType2: "تم طرده من المجموعة"
		}
	},
	logsbot: {
		text: {
			title: "====== سجل البوت ======",
			added: "\n✅\nحدث: تمت إضافة البوت إلى مجموعة جديدة\n- أُضيف بواسطة: %1",
			kicked: "\n❌\nحدث: تم طرد البوت\n- طُرد بواسطة: %1",
			footer: "\n- معرّف المستخدم: %1\n- المجموعة: %2\n- معرّف المجموعة: %3\n- الوقت: %4"
		}
	},
	onEvent: {},
	welcome: {
		text: {
			session1: "الصباح",
			session2: "الظهر",
			session3: "العصر",
			session4: "المساء",
			welcomeMessage: "شكرًا على دعوتي إلى المجموعة!\nبادئة البوت: %1\nلعرض قائمة الأوامر، يرجى كتابة: %1help",
			multiple1: "أنت",
			multiple2: "أنتم"
		}
	}
};
