module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرةً في ملفات الأوامر
	onlyadminbox: {
		description: "تشغيل/إيقاف وضع المديرين فقط لاستخدام البوت",
		guide: "   {pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل وضع مديري المجموعة فقط لاستخدام البوت",
			turnedOff: "تم إلغاء وضع مديري المجموعة فقط لاستخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم {pn} on أو {pn} off فقط"
		}
	},
	adduser: {
		description: "إضافة مستخدم إلى المحادثة الجماعية",
		guide: "   {pn} [رابط الملف الشخصي | المعرّف]",
		text: {
			alreadyInGroup: "المستخدم موجود بالفعل في المجموعة",
			successAdd: "- تمت إضافة %1 عضو بنجاح إلى المجموعة",
			failedAdd: "- فشلت إضافة %1 عضو إلى المجموعة",
			approve: "- تمت إضافة %1 عضو إلى قائمة انتظار الموافقة",
			invalidLink: "يرجى إدخال رابط فيسبوك صالح",
			cannotGetUid: "تعذّر الحصول على معرّف هذا المستخدم",
			linkNotExist: "رابط الملف الشخصي هذا غير موجود",
			cannotAddUser: "البوت محظور أو هذا المستخدم يمنع الغرباء من إضافته للمجموعات"
		}
	},
	admin: {
		description: "إضافة أو إزالة أو تعديل دور المشرف",
		guide: "   {pn} [add | -a] <uid>: منح دور المشرف للمستخدم\n\t  {pn} [remove | -r] <uid>: إزالة دور المشرف من المستخدم\n\t  {pn} [list | -l]: عرض قائمة المشرفين",
		text: {
			added: "✅ | تم منح دور المشرف لـ %1 مستخدم:\n%2",
			alreadyAdmin: "\n⚠️ | %1 مستخدم يمتلك دور المشرف بالفعل:\n%2",
			missingIdAdd: "⚠️ | يرجى إدخال المعرّف أو الإشارة إلى المستخدم لمنحه دور المشرف",
			removed: "✅ | تمت إزالة دور المشرف من %1 مستخدم:\n%2",
			notAdmin: "⚠️ | %1 مستخدم لا يمتلك دور المشرف:\n%2",
			missingIdRemove: "⚠️ | يرجى إدخال المعرّف أو الإشارة إلى المستخدم لإزالة دور المشرف",
			listAdmin: "👑 | قائمة المشرفين:\n%1"
		}
	},
	adminonly: {
		description: "تشغيل/إيقاف وضع مديري البوت فقط",
		guide: "{pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل وضع مديري البوت فقط",
			turnedOff: "تم إلغاء وضع مديري البوت فقط",
			syntaxError: "خطأ في الصياغة، استخدم {pn} on أو {pn} off فقط"
		}
	},
	all: {
		description: "الإشارة إلى جميع أعضاء المجموعة",
		guide: "{pn} [محتوى | فارغ]"
	},
	anime: {
		description: "صورة أنمي عشوائية",
		guide: "{pn} <نقطة النهاية>\n   قائمة نقاط النهاية: neko, kitsune, hug, pat, waifu, cry, kiss, slap, smug, punch",
		text: {
			loading: "جارٍ تجهيز الصورة، يرجى الانتظار...",
			error: "حدث خطأ، يرجى المحاولة مرة أخرى لاحقًا"
		}
	},
	antichangeinfobox: {
		description: "تشغيل/إيقاف الحماية ضد تغيير معلومات المجموعة",
		guide: "   {pn} avt [on | off]: الحماية ضد تغيير صورة المجموعة\n   {pn} name [on | off]: الحماية ضد تغيير اسم المجموعة\n   {pn} theme [on | off]: الحماية ضد تغيير سمة المجموعة\n   {pn} emoji [on | off]: الحماية ضد تغيير إيموجي المجموعة",
		text: {
			antiChangeAvatarOn: "تم تفعيل الحماية ضد تغيير صورة المجموعة",
			antiChangeAvatarOff: "تم إلغاء الحماية ضد تغيير صورة المجموعة",
			missingAvt: "لم تقم بتعيين صورة للمجموعة بعد",
			antiChangeNameOn: "تم تفعيل الحماية ضد تغيير اسم المجموعة",
			antiChangeNameOff: "تم إلغاء الحماية ضد تغيير اسم المجموعة",
			antiChangeThemeOn: "تم تفعيل الحماية ضد تغيير سمة المجموعة",
			antiChangeThemeOff: "تم إلغاء الحماية ضد تغيير سمة المجموعة",
			antiChangeEmojiOn: "تم تفعيل الحماية ضد تغيير إيموجي المجموعة",
			antiChangeEmojiOff: "تم إلغاء الحماية ضد تغيير إيموجي المجموعة",
			antiChangeAvatarAlreadyOn: "الحماية ضد تغيير صورة المجموعة مُفعَّلة بالفعل",
			antiChangeNameAlreadyOn: "الحماية ضد تغيير اسم المجموعة مُفعَّلة بالفعل",
			antiChangeThemeAlreadyOn: "الحماية ضد تغيير سمة المجموعة مُفعَّلة بالفعل",
			antiChangeEmojiAlreadyOn: "الحماية ضد تغيير إيموجي المجموعة مُفعَّلة بالفعل"
		}
	},
	appstore: {
		description: "البحث عن تطبيق في متجر App Store",
		text: {
			missingKeyword: "لم تُدخل أي كلمة بحث",
			noResult: "لم يُعثر على نتائج للكلمة: %1"
		}
	},
	autosetname: {
		description: "تغيير لقب الأعضاء الجدد تلقائيًا",
		guide: "   {pn} set <اللقب>: ضبط الإعداد لتغيير اللقب تلقائيًا، مع الاختصارات:\n   + {userName}: اسم العضو الجديد\n   + {userID}: معرّف العضو\n   مثال:\n    {pn} set {userName} 🚀\n\n   {pn} [on | off]: تشغيل/إيقاف هذه الميزة\n\n   {pn} [view | info]: عرض الإعداد الحالي",
		text: {
			missingConfig: "يرجى إدخال الإعداد المطلوب",
			configSuccess: "تم ضبط الإعداد بنجاح",
			currentConfig: "إعداد autoSetName الحالي في مجموعتك:\n%1",
			notSetConfig: "لم تقم مجموعتك بضبط إعداد autoSetName بعد",
			syntaxError: "خطأ في الصياغة، استخدم \"{pn} on\" أو \"{pn} off\" فقط",
			turnOnSuccess: "تم تفعيل ميزة autoSetName",
			turnOffSuccess: "تم إلغاء ميزة autoSetName",
			error: "حدث خطأ أثناء استخدام ميزة autoSetName، حاول تعطيل ميزة رابط الدعوة في المجموعة وأعد المحاولة لاحقًا"
		}
	},
	avatar: {
		description: "إنشاء صورة أنمي مخصصة مع توقيع",
		guide: "{p}{n} <معرّف الشخصية أو اسمها> | <نص الخلفية> | <التوقيع> | <لون الخلفية أو الكود السداسي>\n{p}{n} help: عرض كيفية استخدام هذا الأمر",
		text: {
			initImage: "جارٍ تجهيز الصورة، يرجى الانتظار...",
			invalidCharacter: "يتوفر حاليًا %1 شخصية فقط، يرجى إدخال معرّف شخصية أقل من",
			notFoundCharacter: "لم يُعثر على شخصية باسم %1 في قائمة الشخصيات",
			errorGetCharacter: "حدث خطأ أثناء الحصول على بيانات الشخصية:\n%1: %2",
			success: "✅ صورتك الشخصية\nالشخصية: %1\nالمعرّف: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
			defaultColor: "افتراضي",
			error: "حدث خطأ\n%1: %2"
		}
	},
	badwords: {
		description: "تشغيل/إيقاف/إضافة/حذف تحذير الكلمات المحظورة، عند المخالفة يُحذَّر العضو، وعند التكرار يُطرد من المجموعة",
		guide: "   {pn} add <الكلمات>: إضافة كلمات محظورة (يمكن إضافة عدة كلمات مفصولة بفواصل \",\" أو خطوط عمودية \"|\")\n   {pn} delete <الكلمات>: حذف كلمات محظورة\n   {pn} list <hide | فارغ>: عرض قائمة الكلمات المحظورة (أضف \"hide\" لإخفاء الكلمات)\n   {pn} unwarn [<معرّف المستخدم> | <@إشارة>]: إزالة تحذير واحد لعضو\n   {pn} on: تفعيل التحذير\n   {pn} off: إلغاء التحذير",
		text: {
			onText: "مُفعَّل",
			offText: "مُعطَّل",
			onlyAdmin: "⚠️ | يُسمح فقط للمديرين بإضافة كلمات إلى قائمة الحظر",
			missingWords: "⚠️ | لم تُدخل الكلمات المحظورة",
			addedSuccess: "✅ | تمت إضافة %1 كلمة محظورة إلى القائمة",
			alreadyExist: "❌ | %1 كلمة موجودة بالفعل في القائمة: %2",
			tooShort: "⚠️ | تعذّر إضافة %1 كلمة لأنها أقصر من حرفين: %2",
			onlyAdmin2: "⚠️ | يُسمح فقط للمديرين بحذف الكلمات من قائمة الحظر",
			missingWords2: "⚠️ | لم تُدخل الكلمات المراد حذفها",
			deletedSuccess: "✅ | تم حذف %1 كلمة محظورة من القائمة",
			notExist: "❌ | %1 كلمة غير موجودة في القائمة: %2",
			emptyList: "⚠️ | قائمة الكلمات المحظورة في مجموعتك فارغة حاليًا",
			badWordsList: "📑 | قائمة الكلمات المحظورة في مجموعتك: %1",
			onlyAdmin3: "⚠️ | يُسمح فقط للمديرين بـ %1 هذه الميزة",
			turnedOnOrOff: "✅ | تم %1 تحذير الكلمات المحظورة",
			onlyAdmin4: "⚠️ | يُسمح فقط للمديرين بحذف تحذير الكلمات المحظورة",
			missingTarget: "⚠️ | لم تُدخل معرّف المستخدم أو تشر إليه",
			notWarned: "⚠️ | لم يُحذَّر المستخدم %1 بسبب كلمات محظورة",
			removedWarn: "✅ | تمت إزالة تحذير الكلمات المحظورة الواحد من المستخدم %1 | %2",
			warned: "⚠️ | تم اكتشاف الكلمات المحظورة \"%1\" في رسالتك، إذا واصلت المخالفة ستُطرد من المجموعة.",
			warned2: "⚠️ | تم اكتشاف الكلمات المحظورة \"%1\" في رسالتك، لقد خالفت المرة الثانية وستُطرد من المجموعة.",
			needAdmin: "يحتاج البوت إلى صلاحيات المشرف لطرد الأعضاء المخالفين",
			unwarned: "✅ | تمت إزالة تحذير الكلمات المحظورة من المستخدم %1 | %2"
		}
	},
	balance: {
		description: "عرض رصيدك أو رصيد العضو المُشار إليه",
		guide: "   {pn}: عرض رصيدك\n   {pn} <@إشارة>: عرض رصيد العضو المُشار إليه",
		text: {
			money: "رصيدك هو %1$",
			moneyOf: "رصيد %1 هو %2$"
		}
	},
	batslap: {
		description: "صورة صفعة",
		text: {
			noTag: "يجب عليك الإشارة إلى الشخص الذي تريد صفعه"
		}
	},
	busy: {
		description: "تفعيل وضع عدم الإزعاج، وعند الإشارة إليك سيُبلَّغ الآخرون",
		guide: "   {pn} [فارغ | <السبب>]: تفعيل وضع عدم الإزعاج\n   {pn} off: إلغاء وضع عدم الإزعاج",
		text: {
			turnedOff: "✅ | تم إلغاء وضع عدم الإزعاج",
			turnedOn: "✅ | تم تفعيل وضع عدم الإزعاج",
			turnedOnWithReason: "✅ | تم تفعيل وضع عدم الإزعاج بالسبب: %1",
			alreadyOn: "المستخدم %1 مشغول حاليًا",
			alreadyOnWithReason: "المستخدم %1 مشغول حاليًا بسبب: %2"
		}
	},
	callad: {
		description: "إرسال تقرير أو ملاحظة أو إبلاغ عن خطأ... إلى مدير البوت",
		guide: "   {pn} <الرسالة>",
		text: {
			missingMessage: "يرجى إدخال الرسالة التي تريد إرسالها للمدير",
			sendByGroup: "\n- أُرسلت من المجموعة: %1\n- معرّف المحادثة: %2",
			sendByUser: "\n- أُرسلت من مستخدم",
			content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nرد على هذه الرسالة للتواصل مع المستخدم",
			success: "تم إرسال رسالتك إلى المدير بنجاح!",
			reply: "📍 رد من المدير %1:\n─────────────────\n%2\n─────────────────\nرد على هذه الرسالة لمواصلة التواصل مع المدير",
			replySuccess: "تم إرسال ردك إلى المدير بنجاح!",
			feedback: "📝 ملاحظة من المستخدم %1:\n- معرّف المستخدم: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nرد على هذه الرسالة للتواصل مع المستخدم",
			replyUserSuccess: "تم إرسال ردك إلى المستخدم بنجاح!"
		}
	},
	cmd: {
		description: "إدارة ملفات الأوامر",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <رابط> <اسم ملف الأمر>: تنزيل وتثبيت ملف أمر من رابط (مسار الملف الخام)",
		text: {
			missingFileName: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل الأمر \"%1\" بالخطأ:\n%2: %3",
			loadedSuccess: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل الأمر \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل الأمر \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل الأمر \"%1\" بالخطأ:\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | يرجى إدخال الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | يرجى إدخال رابط أو كود ملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | يرجى إدخال اسم الملف لحفظ الأمر (بامتداد .js)",
			invalidUrlOrCode: "⚠️ | تعذّر الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل تريد استبدال الملف القديم؟\nتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت الأمر \"%1\" بنجاح، تم حفظ الملف في %2",
			installedError: "❌ | فشل تثبيت الأمر \"%1\" بالخطأ:\n%2: %3",
			missingFile: "⚠️ | ملف الأمر \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم ملف الأمر غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	count: {
		description: "عرض عدد رسائل جميع الأعضاء أو رسائلك (منذ انضمام البوت للمجموعة)",
		guide: "   {pn}: عرض عدد رسائلك\n   {pn} @إشارة: عرض عدد رسائل الأعضاء المُشار إليهم\n   {pn} all: عرض عدد رسائل جميع الأعضاء",
		text: {
			count: "عدد رسائل الأعضاء:",
			endMessage: "من لا يظهر اسمه في القائمة لم يرسل أي رسالة.",
			page: "الصفحة [%1/%2]",
			reply: "ارد على هذه الرسالة برقم الصفحة لعرض المزيد",
			result: "%1 في المرتبة %2 بـ %3 رسالة",
			yourResult: "أنت في المرتبة %1 وقد أرسلت %2 رسالة في هذه المجموعة",
			invalidPage: "رقم الصفحة غير صالح"
		}
	},
	customrankcard: {
		description: "تخصيص بطاقة الترتيب بنفسك",
		guide: {
			body: "   {pn} [maincolor | subcolor | linecolor | progresscolor | alphasubcolor | textcolor | namecolor | expcolor | rankcolor | levelcolor | reset] <القيمة>"
				+ "\n   حيث: "
				+ "\n  + maincolor | background <القيمة>: خلفية بطاقة الترتيب الرئيسية"
				+ "\n  + subcolor <القيمة>: الخلفية الثانوية"
				+ "\n  + linecolor <القيمة>: لون الخط الفاصل بين الخلفيتين"
				+ "\n  + expbarcolor <القيمة>: لون شريط الخبرة"
				+ "\n  + progresscolor <القيمة>: لون شريط الخبرة الحالية"
				+ "\n  + alphasubcolor <القيمة>: شفافية الخلفية الثانوية (من 0 إلى 1)"
				+ "\n  + textcolor <القيمة>: لون النص (كود سداسي أو rgba)"
				+ "\n  + namecolor <القيمة>: لون الاسم"
				+ "\n  + expcolor <القيمة>: لون الخبرة"
				+ "\n  + rankcolor <القيمة>: لون الترتيب"
				+ "\n  + levelcolor <القيمة>: لون المستوى"
				+ "\n    • <القيمة> يمكن أن تكون كودًا سداسيًا أو rgb أو rgba أو تدرجًا (ألوان مفصولة بمسافة) أو رابط صورة"
				+ "\n    • لاستخدام التدرج، أدخل ألوانًا متعددة مفصولة بمسافات"
				+ "\n   {pn} reset: إعادة ضبط كل شيء إلى الافتراضي"
				+ "\n   مثال:"
				+ "\n    {pn} maincolor #fff000"
				+ "\n    {pn} subcolor rgba(255,136,86,0.4)"
				+ "\n    {pn} reset",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_1.jpg`]: "https://i.ibb.co/BZ2Qgs1/image.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_2.png`]: "https://i.ibb.co/wy1ZHHL/image.png"
			}
		},
		text: {
			invalidImage: "رابط الصورة غير صالح، يرجى اختيار رابط ينتهي بامتداد صورة (jpg, jpeg, png, gif)، يمكنك رفع الصورة على https://imgbb.com/ واختيار \"الحصول على رابط مباشر\"",
			invalidAttachment: "المرفق غير صالح، يرجى اختيار ملف صورة",
			invalidColor: "كود اللون غير صالح، يرجى اختيار كود سداسي مكوّن من 6 أرقام أو كود rgba",
			notSupportImage: "رابط الصورة غير مدعوم مع الخيار \"%1\"",
			success: "تم حفظ تغييراتك، إليك معاينة",
			reseted: "تمت إعادة ضبط جميع الإعدادات إلى الافتراضية",
			invalidAlpha: "يرجى اختيار رقم من 0 إلى 1"
		}
	},
	dhbc: {
		description: "لعب لعبة التخمين الكلمي",
		guide: "{pn}",
		text: {
			reply: "يرجى الرد على هذه الرسالة بالإجابة\n%1",
			isSong: "هذا اسم أغنية للمطرب %1",
			notPlayer: "⚠️ لستَ اللاعب المُعيَّن لهذا السؤال",
			correct: "🎉 تهانينا! أجبت بشكل صحيح وحصلت على %1$",
			wrong: "⚠️ إجابتك خاطئة"
		}
	},
	emojimix: {
		description: "دمج إيموجيَّين معًا",
		guide: "   {pn} <إيموجي1> <إيموجي2>\n   مثال:  {pn} 🤣 🥰"
	},
	eval: {
		description: "اختبار الكود بسرعة",
		guide: "{pn} <الكود المراد اختباره>",
		text: {
			error: "❌ حدث خطأ:"
		}
	},
	event: {
		description: "إدارة ملفات أوامر الأحداث",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <رابط> <اسم ملف الأمر>: تنزيل وتحميل أمر حدث، الرابط هو مسار ملف الأمر (خام)",
		text: {
			missingFileName: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إعادة تحميله",
			loaded: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل أمر الحدث \"%1\" بالخطأ:\n%2: %3",
			loadedSuccess: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل أمر الحدث \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | يرجى إدخال اسم الأمر الذي تريد إلغاء تحميله",
			unloaded: "✅ | تم إلغاء تحميل أمر الحدث \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل أمر الحدث \"%1\" بالخطأ:\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | يرجى إدخال الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | يرجى إدخال رابط أو كود ملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | يرجى إدخال اسم الملف لحفظ الأمر (بامتداد .js)",
			invalidUrlOrCode: "⚠️ | تعذّر الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل تريد استبدال الملف القديم؟\nتفاعل مع هذه الرسالة للمتابعة",
			installed: "✅ | تم تثبيت أمر الحدث \"%1\" بنجاح، تم حفظ الملف في %2",
			installedError: "❌ | فشل تثبيت أمر الحدث \"%1\" بالخطأ:\n%2: %3",
			missingFile: "⚠️ | الملف \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم الملف غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	filteruser: {
		description: "تصفية أعضاء المجموعة حسب عدد الرسائل أو الحسابات المقفلة",
		guide: "   {pn} [<عدد الرسائل> | die]",
		text: {
			needAdmin: "⚠️ | يرجى إضافة البوت كمشرف في المجموعة لاستخدام هذا الأمر",
			confirm: "⚠️ | هل أنت متأكد من حذف أعضاء المجموعة الذين أرسلوا أقل من %1 رسالة؟\nتفاعل مع هذه الرسالة للتأكيد",
			kickByBlock: "✅ | تم حذف %1 عضو بحسابات مقفلة بنجاح",
			kickByMsg: "✅ | تم حذف %1 عضو أرسلوا أقل من %2 رسالة بنجاح",
			kickError: "❌ | حدث خطأ ولم يتمكن البوت من طرد %1 عضو:\n%2",
			noBlock: "✅ | لا يوجد أعضاء بحسابات مقفلة",
			noMsg: "✅ | لا يوجد أعضاء أرسلوا أقل من %1 رسالة"
		}
	},
	getfbstate: {
		description: "الحصول على fbstate الحالية",
		guide: "{pn}",
		text: {
			success: "تم إرسال fbstate إليك، يرجى مراجعة رسائل البوت الخاصة"
		}
	},
	grouptag: {
		description: "الإشارة إلى الأعضاء حسب المجموعة",
		guide: "   {pn} add <اسم المجموعة> <@إشارات>: إضافة مجموعة إشارات جديدة أو إضافة أعضاء إليها\n   مثال:\n    {pn} TEAM1 @tag1 @tag2\n\n   {pn} del <اسم المجموعة> <@إشارات>: إزالة أعضاء من مجموعة الإشارات\n   مثال:\n    {pn} del TEAM1 @tag1 @tag2\n\n   {pn} remove <اسم المجموعة>: حذف مجموعة الإشارات\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} rename <اسم المجموعة> | <الاسم الجديد>: إعادة تسمية مجموعة الإشارات\n\n   {pn} [list | all]: عرض قائمة مجموعات الإشارات في مجموعتك\n\n   {pn} info <اسم المجموعة>: عرض معلومات مجموعة الإشارات",
		text: {
			noGroupTagName: "يرجى إدخال اسم مجموعة الإشارات",
			noMention: "لم تُشر إلى أي عضو لإضافته إلى مجموعة الإشارات",
			addedSuccess: "تمت إضافة الأعضاء:\n%1\nإلى مجموعة الإشارات \"%2\"",
			addedSuccess2: "تمت إضافة مجموعة الإشارات \"%1\" بالأعضاء:\n%2",
			existedInGroupTag: "الأعضاء:\n%1\nموجودون بالفعل في مجموعة الإشارات \"%2\"",
			notExistedInGroupTag: "الأعضاء:\n%1\nغير موجودين في مجموعة الإشارات \"%2\"",
			noExistedGroupTag: "مجموعة الإشارات \"%1\" غير موجودة في مجموعتك",
			noExistedGroupTag2: "لم تُضَف أي مجموعة إشارات إلى مجموعتك بعد",
			noMentionDel: "يرجى الإشارة إلى الأعضاء لإزالتهم من مجموعة الإشارات \"%1\"",
			deletedSuccess: "تمت إزالة الأعضاء:\n%1\nمن مجموعة الإشارات \"%2\"",
			deletedSuccess2: "تم حذف مجموعة الإشارات \"%1\"",
			tagged: "إشارة المجموعة \"%1\":\n%2",
			noGroupTagName2: "يرجى إدخال الاسم القديم والاسم الجديد لمجموعة الإشارات مفصولَين بـ \"|\"",
			renamedSuccess: "تمت إعادة تسمية مجموعة الإشارات من \"%1\" إلى \"%2\"",
			infoGroupTag: "📑 | اسم المجموعة: \"%1\"\n👥 | عدد الأعضاء: %2\n👨‍👩‍👧‍👦 | قائمة الأعضاء:\n %3"
		}
	},
	help: {
		description: "عرض طريقة استخدام الأوامر",
		guide: "{pn} [فارغ | <رقم الصفحة> | <اسم الأمر>]",
		text: {
			help: "╭─────────────⭓\n%1\n├─────⭔\n│ الصفحة [ %2/%3 ]\n│ يمتلك البوت حاليًا %4 أمرًا متاحًا\n│ » اكتب %5help <رقم الصفحة> لعرض قائمة الأوامر\n│ » اكتب %5help لعرض تفاصيل استخدام أي أمر\n├────────⭔\n│ %6\n╰─────────────⭓",
			help2: "%1├───────⭔\n│ » يمتلك البوت حاليًا %2 أمرًا متاحًا\n│ » اكتب %3help <اسم الأمر> لعرض تفاصيل استخدامه\n│ %4\n╰─────────────⭓",
			commandNotFound: "الأمر \"%1\" غير موجود",
			getInfoCommand: "╭── الاسم ────⭓\n│ %1\n├── المعلومات\n│ الوصف: %2\n│ أسماء أخرى: %3\n│ أسماء أخرى في مجموعتك: %4\n│ الإصدار: %5\n│ الدور: %6\n│ الفترة بين الأوامر: %7 ثانية\n│ المؤلف: %8\n├── الاستخدام\n%9\n├── ملاحظات\n│ المحتوى داخل <XXXXX> قابل للتغيير\n│ المحتوى داخل [a|b|c] يعني a أو b أو c\n╰──────⭔",
			doNotHave: "لا يوجد",
			roleText0: "0 (جميع المستخدمين)",
			roleText1: "1 (مديرو المجموعة)",
			roleText2: "2 (مديرو البوت)",
			roleText0setRole: "0 (تعيين الدور، جميع المستخدمين)",
			roleText1setRole: "1 (تعيين الدور، مديرو المجموعة)",
			pageNotFound: "الصفحة %1 غير موجودة"
		}
	},
	kick: {
		description: "طرد عضو من المحادثة الجماعية",
		guide: "{pn} @إشارات: طرد الأعضاء المُشار إليهم"
	},
	loadconfig: {
		description: "إعادة تحميل إعدادات البوت"
	},
	moon: {
		description: "عرض صورة القمر في اليوم الذي تختاره (يوم/شهر/سنة)",
		guide: "  {pn} <يوم/شهر/سنة>\n   {pn} <يوم/شهر/سنة> <تعليق>",
		text: {
			invalidDateFormat: "يرجى إدخال تاريخ صالح بصيغة DD/MM/YYYY",
			error: "حدث خطأ أثناء الحصول على صورة القمر بتاريخ %1",
			invalidDate: "التاريخ %1 غير صالح",
			caption: "- صورة القمر بتاريخ %1"
		}
	},
	notification: {
		description: "إرسال إشعار من المدير إلى جميع المجموعات",
		guide: "{pn} <الرسالة>",
		text: {
			missingMessage: "يرجى إدخال الرسالة التي تريد إرسالها إلى جميع المجموعات",
			notification: "إشعار من مدير البوت إلى جميع المحادثات الجماعية (لا ترد على هذه الرسالة)",
			sendingNotification: "بدء إرسال الإشعار من مدير البوت إلى %1 مجموعة",
			sentNotification: "✅ تم إرسال الإشعار إلى %1 مجموعة بنجاح",
			errorSendingNotification: "حدث خطأ أثناء الإرسال إلى %1 مجموعة:\n %2"
		}
	},
	prefix: {
		description: "تغيير بادئة الأوامر في مجموعتك أو على مستوى النظام (لمديري البوت فقط)",
		guide: "   {pn} <البادئة الجديدة>: تغيير البادئة في مجموعتك\n   مثال:\n    {pn} #\n\n   {pn} <البادئة الجديدة> -g: تغيير البادئة على مستوى النظام (لمديري البوت فقط)\n   مثال:\n    {pn} # -g\n\n   {pn} reset: إعادة ضبط بادئة مجموعتك إلى الافتراضية",
		text: {
			reset: "تمت إعادة ضبط بادئتك إلى الافتراضية: %1",
			onlyAdmin: "يُسمح فقط للمديرين بتغيير بادئة النظام",
			confirmGlobal: "يرجى التفاعل مع هذه الرسالة لتأكيد تغيير بادئة النظام",
			confirmThisThread: "يرجى التفاعل مع هذه الرسالة لتأكيد تغيير البادئة في مجموعتك",
			successGlobal: "تم تغيير بادئة النظام إلى: %1",
			successThisThread: "تم تغيير البادئة في مجموعتك إلى: %1",
			myPrefix: "🌐 بادئة النظام: %1\n🛸 بادئة مجموعتك: %2"
		}
	},
	rank: {
		description: "عرض مستواك أو مستوى العضو المُشار إليه. يمكنك الإشارة إلى عدة أشخاص"
	},
	rankup: {
		description: "تشغيل/إيقاف إشعار الترقي في المستوى",
		guide: "{pn} [on | off]",
		text: {
			syntaxError: "خطأ في الصياغة، استخدم {pn} on أو {pn} off فقط",
			turnedOn: "تم تفعيل إشعار الترقي في المستوى",
			turnedOff: "تم إلغاء إشعار الترقي في المستوى",
			notiMessage: "🎉🎉 تهانينا على الوصول إلى المستوى %1"
		}
	},
	refresh: {
		description: "تحديث معلومات المجموعة أو المستخدم",
		guide: "   {pn} [thread | group]: تحديث معلومات مجموعتك\n   {pn} group <معرّف المجموعة>: تحديث معلومات مجموعة بمعرّفها\n\n   {pn} user: تحديث معلومات مستخدمك\n   {pn} user [<معرّف المستخدم> | @إشارة]: تحديث معلومات مستخدم بمعرّفه",
		text: {
			refreshMyThreadSuccess: "✅ | تم تحديث معلومات مجموعتك بنجاح!",
			refreshThreadTargetSuccess: "✅ | تم تحديث معلومات المجموعة %1 بنجاح!"
		}
	},
	rules: {
		description: "إنشاء/عرض/إضافة/تعديل/تغيير ترتيب/حذف قواعد مجموعتك",
		guide: "   {pn} [add | -a] <القاعدة>: إضافة قاعدة للمجموعة.\n   {pn}: عرض قواعد المجموعة.\n   {pn} [edit | -e] <رقم> <المحتوى الجديد>: تعديل القاعدة رقم n.\n   {pn} [move | -m] <ترتيب1> <ترتيب2>: تبديل مكان القاعدتين.\n   {pn} [delete | -d] <رقم>: حذف القاعدة رقم n.\n   {pn} [remove | -r]: حذف جميع قواعد المجموعة.\n\n   مثال:\n    {pn} add لا تزعج الآخرين\n    {pn} move 1 3\n    {pn} -e 1 لا ترسل رسائل مزعجة\n    {pn} -r"
	},
	sendnoti: {
		description: "إنشاء وإرسال إشعارات إلى المجموعات التي تديرها",
		guide: "   {pn} create <اسم المجموعة>: إنشاء مجموعة إشعارات جديدة\n   مثال:\n    {pn} create TEAM1\n\n   {pn} add <اسم المجموعة>: إضافة المحادثة الحالية إلى مجموعة الإشعارات (يجب أن تكون مديرًا)\n   مثال:\n    {pn} add TEAM1\n\n   {pn} delete: إزالة المحادثة الحالية من مجموعة الإشعارات (يجب أن تكون المنشئ)\n   مثال:\n    {pn} delete TEAM1\n\n   {pn} send <اسم المجموعة> | <الرسالة>: إرسال إشعار إلى جميع مجموعات الإشعارات (يجب أن تكون مديرًا)\n   مثال:\n    {pn} remove TEAM1\n\n   {pn} remove <اسم المجموعة>: حذف مجموعة الإشعارات (يجب أن تكون المنشئ)\n   مثال:\n    {pn} remove TEAM1",
		text: {
			missingGroupName: "يرجى إدخال اسم مجموعة الإشعارات",
			groupNameExists: "مجموعة الإشعارات باسم %1 موجودة بالفعل، يرجى اختيار اسم آخر",
			createdGroup: "تم إنشاء مجموعة الإشعارات بنجاح:\n- الاسم: %1\n- المعرّف: %2",
			missingGroupNameToAdd: "يرجى إدخال اسم مجموعة الإشعارات التي تريد إضافة هذه المحادثة إليها",
			groupNameNotExists: "لم تُنشئ أو تُدر أي مجموعة إشعارات باسم: %1",
			notAdmin: "لست مديرًا في هذه المجموعة",
			added: "تمت إضافة المحادثة الحالية إلى مجموعة الإشعارات: %1",
			missingGroupNameToDelete: "يرجى إدخال اسم مجموعة الإشعارات التي تريد إزالة هذه المحادثة منها",
			notInGroup: "المحادثة الحالية غير موجودة في مجموعة الإشعارات %1",
			deleted: "تمت إزالة المحادثة الحالية من مجموعة الإشعارات: %1",
			failed: "فشل إرسال الإشعار إلى %1 مجموعة:\n%2",
			missingGroupNameToRemove: "يرجى إدخال اسم مجموعة الإشعارات التي تريد حذفها",
			removed: "تم حذف مجموعة الإشعارات: %1",
			missingGroupNameToSend: "يرجى إدخال اسم مجموعة الإشعارات التي تريد الإرسال إليها",
			groupIsEmpty: "مجموعة الإشعارات \"%1\" فارغة",
			sending: "جارٍ إرسال الإشعار إلى %1 مجموعة",
			success: "تم إرسال الإشعار إلى %1 مجموعة في مجموعة الإشعارات \"%2\" بنجاح",
			notAdminOfGroup: "لست مديرًا في هذه المجموعة",
			missingGroupNameToView: "يرجى إدخال اسم مجموعة الإشعارات التي تريد عرض معلوماتها",
			groupInfo: "- اسم المجموعة: %1\n - المعرّف: %2\n - تاريخ الإنشاء: %3\n%4 ",
			groupInfoHasGroup: "- تحتوي على المحادثات: \n%1",
			noGroup: "لم تُنشئ أو تُدر أي مجموعة إشعارات بعد"
		}
	},
	setalias: {
		description: "إضافة اسم مستعار لأي أمر في مجموعتك",
		guide: "  يُستخدم هذا الأمر لإضافة/إزالة اسم مستعار لأي أمر في مجموعتك\n   {pn} add <الاسم المستعار> <الأمر>: إضافة اسم مستعار للأمر في مجموعتك\n   {pn} add <الاسم المستعار> <الأمر> -g: إضافة اسم مستعار للأمر على مستوى النظام (لمديري البوت فقط)\nمثال:\n    {pn} add ctrk customrankcard\n\n   {pn} [remove | rm] <الاسم المستعار> <الأمر>: إزالة اسم مستعار للأمر في مجموعتك\n   {pn} [remove | rm] <الاسم المستعار> <الأمر> -g: إزالة اسم مستعار للأمر على مستوى النظام (لمديري البوت فقط)\nمثال:\n    {pn} rm ctrk customrankcard\n\n   {pn} list: عرض جميع الأسماء المستعارة للأوامر في مجموعتك\n   {pn} list -g: عرض جميع الأسماء المستعارة للأوامر على مستوى النظام"
	},
	setavt: {
		description: "تغيير صورة البوت",
		text: {
			cannotGetImage: "❌ | حدث خطأ أثناء الاستعلام عن رابط الصورة",
			invalidImageFormat: "❌ | صيغة الصورة غير صالحة",
			changedAvatar: "✅ | تم تغيير صورة البوت بنجاح"
		}
	},
	setlang: {
		description: "تعيين اللغة الافتراضية للبوت في المحادثة الحالية أو جميع المحادثات",
		guide: "   {pn} <كود اللغة ISO 639-1>\n   مثال:    {pn} ar    {pn} en    {pn} vi",
		text: {
			setLangForAll: "تم تعيين اللغة الافتراضية لجميع المحادثات: %1",
			setLangForCurrent: "تم تعيين اللغة الافتراضية للمحادثة الحالية: %1",
			noPermission: "يُسمح فقط لمديري البوت باستخدام هذا الأمر"
		}
	},
	setleave: {
		description: "تعديل محتوى/تشغيل/إيقاف رسالة المغادرة عند مغادرة أعضاء مجموعتك",
		guide: {
			body: "   {pn} on: تفعيل رسالة المغادرة\n   {pn} off: إلغاء رسالة المغادرة\n   {pn} text [<المحتوى> | reset]: تعديل نص الرسالة أو إعادة ضبطه، مع الاختصارات:\n  + {userName}: اسم العضو المغادر\n  + {userNameTag}: اسم العضو المغادر (مع الإشارة)\n  + {boxName}: اسم المجموعة\n  + {type}: غادر/تم طرده\n  + {session}: وقت اليوم\n\n   مثال:\n    {pn} text {userName} {type} المجموعة، إلى اللقاء 🤧\n\n   ارد على رسالة أو أرسل رسالة مع ملف بمحتوى {pn} file: لإضافة مرفق لرسالة المغادرة (صورة، فيديو، صوت)\n\nمثال:\n   {pn} file reset: إعادة ضبط الملف",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setleave/setleave_en_1.png`]: "https://i.ibb.co/2FKJHJr/guide1.png"
			}
		},
		text: {
			missingContent: "يرجى إدخال المحتوى",
			edited: "تم تعديل محتوى رسالة المغادرة في مجموعتك إلى:\n%1",
			reseted: "تمت إعادة ضبط محتوى رسالة المغادرة",
			noFile: "لا يوجد ملف مرفق لرسالة المغادرة لإعادة ضبطه",
			resetedFile: "تمت إعادة ضبط ملف مرفق رسالة المغادرة بنجاح",
			missingFile: "يرجى الرد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 ملف مرفق إلى رسالة المغادرة"
		}
	},
	setname: {
		description: "تغيير لقب جميع أعضاء المحادثة أو الأعضاء المُشار إليهم بصيغة معينة",
		guide: {
			body: "   {pn} <اللقب>: تغيير لقبك\n   {pn} @إشارات <اللقب>: تغيير لقب الأعضاء المُشار إليهم\n   {pn} all <اللقب>: تغيير لقب جميع أعضاء المحادثة\n\nمع الاختصارات المتاحة:\n   + {userName}: اسم العضو\n   + {userID}: معرّف العضو\n\n   مثال: (انظر الصورة)",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_1.png`]: "https://i.ibb.co/gFh23zb/guide1.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_2.png`]: "https://i.ibb.co/BNWHKgj/guide2.png"
			}
		},
		text: {
			error: "حدث خطأ، حاول تعطيل ميزة رابط الدعوة في المجموعة وأعد المحاولة لاحقًا"
		}
	},
	setrole: {
		description: "تعديل دور الأمر (الأوامر ذات الدور أقل من 2)",
		guide: "   {pn} <اسم الأمر> <الدور الجديد>: تعيين دور جديد للأمر\n   مع:\n   + <اسم الأمر>: اسم الأمر\n   + <الدور الجديد>: الدور الجديد للأمر:\n   + <الدور الجديد> = 0: يمكن لجميع الأعضاء استخدام الأمر\n   + <الدور الجديد> = 1: يمكن للمديرين فقط استخدام الأمر\n   + <الدور الجديد> = default: إعادة ضبط دور الأمر إلى الافتراضي\n   مثال:\n    {pn} rank 1: (لمديري المجموعة فقط)\n    {pn} rank 0: (لجميع أعضاء المجموعة)\n    {pn} rank default: إعادة الضبط\n—————\n   {pn} [viewrole|view|show]: عرض الأوامر المعدَّلة",
		text: {
			noEditedCommand: "✅ لا توجد أوامر معدَّلة في مجموعتك",
			editedCommand: "⚠️ توجد أوامر معدَّلة في مجموعتك:\n",
			noPermission: "❗ يُسمح فقط للمديرين باستخدام هذا الأمر",
			commandNotFound: "الأمر \"%1\" غير موجود",
			noChangeRole: "❗ لا يمكن تغيير دور الأمر \"%1\"",
			resetRole: "تمت إعادة ضبط دور الأمر \"%1\" إلى الافتراضي",
			changedRole: "تم تغيير دور الأمر \"%1\" إلى %2"
		}
	},
	setwelcome: {
		description: "تعديل محتوى رسالة الترحيب عند انضمام أعضاء جدد إلى مجموعتك",
		guide: {
			body: "   {pn} text [<المحتوى> | reset]: تعديل نص الرسالة أو إعادة ضبطه، مع الاختصارات:\n  + {userName}: اسم العضو الجديد\n  + {userNameTag}: اسم العضو الجديد (مع الإشارة)\n  + {boxName}: اسم المجموعة\n  + {multiple}: أنت || أنتم\n  + {session}: وقت اليوم\n\n   مثال:\n    {pn} text أهلًا {userName}، مرحبًا بك في {boxName}، نتمنى لك يومًا سعيدًا {multiple}\n\n   ارد على رسالة أو أرسل رسالة مع ملف بمحتوى {pn} file: لإضافة مرفقات لرسالة الترحيب (صورة، فيديو، صوت)\n\n   مثال:\n    {pn} file reset: حذف المرفقات",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setwelcome/setwelcome_en_1.png`]: "https://i.ibb.co/vsCz0ks/setwelcome-en-1.png"
			}
		},
		text: {
			missingContent: "يرجى إدخال محتوى رسالة الترحيب",
			edited: "تم تعديل محتوى رسالة الترحيب في مجموعتك إلى: %1",
			reseted: "تمت إعادة ضبط محتوى رسالة الترحيب",
			noFile: "لا توجد مرفقات لحذفها",
			resetedFile: "تمت إعادة ضبط المرفقات بنجاح",
			missingFile: "يرجى الرد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 مرفق إلى رسالة الترحيب في مجموعتك"
		}
	},
	shortcut: {
		description: "إضافة اختصار لرسالتك في المجموعة",
		text: {
			missingContent: 'يرجى إدخال محتوى الرسالة',
			shortcutExists: 'الاختصار "%1" موجود بالفعل، تفاعل مع هذه الرسالة لاستبدال محتوى الاختصار',
			shortcutExistsByOther: 'الاختصار %1 أُضيف من قِبَل عضو آخر، يرجى تجربة كلمة مفتاحية أخرى',
			added: 'تمت إضافة الاختصار %1 => %2',
			addedAttachment: ' مع %1 مرفق(ات)',
			missingKey: 'يرجى إدخال الكلمة المفتاحية للاختصار الذي تريد حذفه',
			notFound: 'لم يُعثر على اختصار للكلمة المفتاحية %1 في مجموعتك',
			onlyAdmin: 'يُسمح فقط للمديرين بحذف اختصارات الآخرين',
			deleted: 'تم حذف الاختصار %1',
			empty: 'لم تُضَف أي اختصارات إلى مجموعتك بعد',
			message: 'الرسالة',
			attachment: 'المرفق',
			list: 'قائمة اختصاراتك',
			onlyAdminRemoveAll: 'يُسمح فقط للمديرين بحذف جميع الاختصارات في المجموعة',
			confirmRemoveAll: 'هل أنت متأكد من حذف جميع الاختصارات في هذه المجموعة؟ (تفاعل مع هذه الرسالة للتأكيد)',
			removedAll: 'تم حذف جميع الاختصارات في مجموعتك'
		}
	},
	simsimi: {
		description: "الدردشة مع simsimi",
		guide: "   {pn} [on | off]: تشغيل/إيقاف simsimi\n\n   {pn} <كلمة>: الدردشة مع simsimi\n   مثال:\n    {pn} مرحبا",
		text: {
			turnedOn: "تم تفعيل simsimi بنجاح!",
			turnedOff: "تم إلغاء simsimi بنجاح!",
			chatting: "جارٍ الدردشة مع simsimi...",
			error: "simsimi مشغول، يرجى المحاولة مرة أخرى لاحقًا"
		}
	},
	sorthelp: {
		description: "ترتيب قائمة المساعدة",
		guide: "{pn} [name | category]",
		text: {
			savedName: "تم حفظ ترتيب قائمة المساعدة حسب الاسم",
			savedCategory: "تم حفظ ترتيب قائمة المساعدة حسب الفئة"
		}
	},
	thread: {
		description: "إدارة المجموعات في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم>: البحث عن مجموعة في بيانات البوت بالاسم\n   {pn} [find | -f | search | -s] [-j | joined] <الاسم>: البحث عن مجموعات لا يزال البوت فيها\n   {pn} [ban | -b] [<معرّف المجموعة> | فارغ] <السبب>: حظر مجموعة بمعرّفها أو المجموعة الحالية\n   مثال:\n    {pn} ban 3950898668362484 بريد مزعج\n    {pn} ban إزعاج شديد\n    {pn} unban [<معرّف المجموعة> | فارغ] لإلغاء حظر مجموعة",
		text: {
			noPermission: "ليس لديك صلاحية استخدام هذه الميزة",
			found: "🔎 تم العثور على %1 مجموعة تطابق الكلمة المفتاحية \"%3\" في بيانات البوت:\n%3",
			notFound: "❌ لم يُعثر على مجموعة تطابق الكلمة المفتاحية: \"%1\" في بيانات البوت",
			hasBanned: "المجموعة ذات المعرّف [%1 | %2] محظورة بالفعل:\n» السبب: %3\n» الوقت: %4",
			banned: "تم حظر المجموعة ذات المعرّف [%1 | %2] من استخدام البوت.\n» السبب: %3\n» الوقت: %4",
			notBanned: "المجموعة ذات المعرّف [%1 | %2] غير محظورة",
			unbanned: "تم إلغاء حظر المجموعة ذات المعرّف [%1 | %2]",
			missingReason: "لا يمكن أن يكون سبب الحظر فارغًا",
			info: "» معرّف المحادثة: %1\n» الاسم: %2\n» تاريخ إنشاء البيانات: %3\n» إجمالي الأعضاء: %4\n» الذكور: %5 عضو\n» الإناث: %6 عضو\n» إجمالي الرسائل: %7%8"
		}
	},
	tid: {
		description: "عرض معرّف مجموعتك",
		guide: "{pn}"
	},
	tik: {
		description: "تنزيل فيديو/سلايد (صور) أو صوت من رابط TikTok",
		guide: "   {pn} [video|-v|v] <رابط>: تنزيل فيديو/سلايد من TikTok.\n   {pn} [audio|-a|a] <رابط>: تنزيل صوت من TikTok",
		text: {
			invalidUrl: "يرجى إدخال رابط TikTok صالح",
			downloadingVideo: "جارٍ تنزيل الفيديو: %1...",
			downloadedSlide: "تم تنزيل السلايد: %1\n%2",
			downloadedVideo: "تم تنزيل الفيديو: %1\nرابط التنزيل: %2",
			downloadingAudio: "جارٍ تنزيل الصوت: %1...",
			downloadedAudio: "تم تنزيل الصوت: %1"
		}
	},
	trigger: {
		description: "صورة trigger",
		guide: "{pn} [@إشارة | فارغ]"
	},
	uid: {
		description: "عرض معرّف مستخدم فيسبوك",
		guide: "   {pn}: عرض معرّفك\n   {pn} @إشارة: عرض معرّف الأشخاص المُشار إليهم\n   {pn} <رابط الملف الشخصي>: عرض معرّف رابط الملف الشخصي",
		text: {
			syntaxError: "يرجى الإشارة إلى الشخص الذي تريد معرفة معرّفه أو اتركه فارغًا لعرض معرّفك"
		}
	},
	unsend: {
		description: "حذف رسالة البوت",
		guide: "ارد على الرسالة التي تريد حذفها واستدعِ الأمر {pn}",
		text: {
			syntaxError: "يرجى الرد على الرسالة التي تريد حذفها"
		}
	},
	user: {
		description: "إدارة المستخدمين في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم>: البحث عن مستخدمين في بيانات البوت بالاسم\n\n   {pn} [ban | -b] [<معرّف المستخدم> | @إشارة | الرد على رسالة] <السبب>: حظر مستخدم\n\n   {pn} unban [<معرّف المستخدم> | @إشارة | الرد على رسالة]: إلغاء حظر مستخدم",
		text: {
			noUserFound: "❌ لم يُعثر على مستخدم يطابق الكلمة المفتاحية: \"%1\" في بيانات البوت",
			userFound: "🔎 تم العثور على %1 مستخدم يطابق الكلمة المفتاحية \"%2\" في بيانات البوت:\n%3",
			uidRequired: "معرّف المستخدم المراد حظره لا يمكن أن يكون فارغًا، يرجى إدخال المعرّف أو الإشارة أو الرد على رسالة المستخدم",
			reasonRequired: "سبب الحظر لا يمكن أن يكون فارغًا، يرجى إدخال المعرّف أو الإشارة أو الرد على رسالة المستخدم",
			userHasBanned: "المستخدم ذو المعرّف [%1 | %2] محظور بالفعل:\n» السبب: %3\n» التاريخ: %4",
			userBanned: "تم حظر المستخدم ذي المعرّف [%1 | %2]:\n» السبب: %3\n» التاريخ: %4",
			uidRequiredUnban: "معرّف المستخدم المراد إلغاء حظره لا يمكن أن يكون فارغًا",
			userNotBanned: "المستخدم ذو المعرّف [%1 | %2] غير محظور",
			userUnbanned: "تم إلغاء حظر المستخدم ذي المعرّف [%1 | %2]"
		}
	},
	videofb: {
		description: "تنزيل فيديو/قصة من فيسبوك (عامة)",
		guide: "   {pn} <رابط الفيديو/القصة>: تنزيل فيديو من فيسبوك",
		text: {
			missingUrl: "يرجى إدخال رابط الفيديو/القصة العامة على فيسبوك",
			error: "حدث خطأ أثناء تنزيل الفيديو",
			downloading: "جارٍ تنزيل الفيديو لك",
			tooLarge: "نعتذر، لا يمكننا تنزيل الفيديو لأن حجمه يتجاوز 83 ميغابايت"
		}
	},
	warn: {
		description: "تحذير عضو في المجموعة، وعند 3 تحذيرات يُحظر",
		guide: "   {pn} @إشارة <السبب>: تحذير عضو\n   {pn} list: عرض قائمة المحذَّرين\n   {pn} listban: عرض قائمة المحظورين\n   {pn} info [@إشارة | <معرّف> | فارغ]: عرض معلومات تحذير عضو أو معرّف أو نفسك\n   {pn} unban <معرّف>: إلغاء حظر عضو بمعرّفه\n   {pn} unwarn <معرّف> [<رقم التحذير> | فارغ]: إزالة تحذير عضو\n   {pn} warn reset: إعادة ضبط جميع بيانات التحذير\n⚠️ تحتاج إلى تعيين البوت كمشرف لطرد الأعضاء المحظورين تلقائيًا",
		text: {
			list: "قائمة الأعضاء المحذَّرين:\n%1\n\nلعرض تفاصيل التحذيرات، استخدم الأمر \"%2warn info [@إشارة | <معرّف> | فارغ]\"",
			listBan: "قائمة الأعضاء الذين تلقّوا 3 تحذيرات وتم حظرهم:\n%1",
			listEmpty: "لا يوجد أعضاء محذَّرون في مجموعتك",
			listBanEmpty: "لا يوجد أعضاء محظورون في مجموعتك",
			invalidUid: "يرجى إدخال معرّف صالح للشخص الذي تريد عرض معلوماته",
			noData: "لا توجد بيانات",
			noPermission: "❌ يُسمح فقط لمديري المجموعة بإلغاء حظر الأعضاء",
			invalidUid2: "⚠️ يرجى إدخال معرّف صالح للشخص الذي تريد إلغاء حظره",
			notBanned: "⚠️ المستخدم ذو المعرّف %1 غير محظور في مجموعتك",
			unbanSuccess: "✅ تم إلغاء حظر العضو [%1 | %2] بنجاح، يمكنه الانضمام إلى مجموعتك مجددًا",
			noPermission2: "❌ يُسمح فقط لمديري المجموعة بإزالة تحذيرات الأعضاء",
			invalidUid3: "⚠️ يرجى إدخال معرّف أو الإشارة إلى الشخص الذي تريد إزالة تحذيره",
			noData2: "⚠️ المستخدم ذو المعرّف %1 لا توجد له بيانات تحذير",
			notEnoughWarn: "❌ المستخدم %1 لديه %2 تحذيرات فقط",
			unwarnSuccess: "✅ تمت إزالة التحذير رقم %1 من العضو [%2 | %3] بنجاح",
			noPermission3: "❌ يُسمح فقط لمديري المجموعة بإعادة ضبط بيانات التحذير",
			resetWarnSuccess: "✅ تمت إعادة ضبط بيانات التحذير بنجاح",
			noPermission4: "❌ يُسمح فقط لمديري المجموعة بتحذير الأعضاء",
			invalidUid4: "⚠️ يجب عليك الإشارة إلى الشخص أو الرد على رسالته لتحذيره",
			warnSuccess: "⚠️ تم تحذير العضو %1 مرة %2\n- المعرّف: %3\n- السبب: %4\n- التاريخ والوقت: %5\nتلقّى هذا العضو 3 تحذيرات وتم حظره، لإلغاء الحظر استخدم الأمر \"%6warn unban <معرّف>\"",
			noPermission5: "⚠️ يحتاج البوت إلى صلاحيات المشرف لطرد الأعضاء المحظورين",
			warnSuccess2: "⚠️ تم تحذير العضو %1 مرة %2\n- المعرّف: %3\n- السبب: %4\n- التاريخ والوقت: %5\nإذا خالف %6 مرات إضافية سيُحظر",
			hasBanned: "⚠️ الأعضاء التاليون تلقّوا 3 تحذيرات وتم حظرهم:\n%1",
			failedKick: "⚠️ حدث خطأ أثناء طرد الأعضاء التاليين:\n%1"
		}
	},
	weather: {
		description: "عرض حالة الطقس الحالية وتوقعات 5 أيام قادمة",
		guide: "{pn} <الموقع>",
		text: {
			syntaxError: "يرجى إدخال موقع",
			notFound: "الموقع غير موجود: %1",
			error: "حدث خطأ: %1",
			today: "طقس اليوم:\n%1\n🌡 درجة الحرارة الدنيا - العليا %2°م - %3°م\n🌡 تبدو وكأنها %4°م - %5°م\n🌅 الشروق %6\n🌄 الغروب %7\n🌃 شروق القمر %8\n🏙️ غروب القمر %9\n🌞 النهار: %10\n🌙 الليل: %11"
		}
	},
	ytb: {
		description: "تنزيل فيديو أو صوت أو عرض معلومات فيديو على YouTube",
		guide: "   {pn} [video|-v] [<اسم الفيديو>|<رابط الفيديو>]: تنزيل فيديو من YouTube.\n   {pn} [audio|-a] [<اسم الفيديو>|<رابط الفيديو>]: تنزيل صوت من YouTube\n   {pn} [info|-i] [<اسم الفيديو>|<رابط الفيديو>]: عرض معلومات فيديو من YouTube\n   مثال:\n    {pn} -v Fallen Kingdom\n    {pn} -a Fallen Kingdom\n    {pn} -i Fallen Kingdom",
		text: {
			error: "حدث خطأ: %1",
			noResult: "لا توجد نتائج بحث تطابق الكلمة المفتاحية %1",
			choose: "%1ارد على الرسالة برقم اختيارك أو بأي محتوى للإلغاء",
			downloading: "جارٍ تنزيل الفيديو %1",
			noVideo: "نعتذر، لم يُعثر على فيديو بحجم أقل من 83 ميغابايت",
			downloadingAudio: "جارٍ تنزيل الصوت %1",
			noAudio: "نعتذر، لم يُعثر على صوت بحجم أقل من 26 ميغابايت",
			info: "💠 العنوان: %1\n🏪 القناة: %2\n👨‍👩‍👧‍👦 المشتركون: %3\n⏱ مدة الفيديو: %4\n👀 المشاهدات: %5\n👍 الإعجابات: %6\n🆙 تاريخ الرفع: %7\n🔠 المعرّف: %8\n🔗 الرابط: %9",
			listChapter: "\n📖 قائمة الفصول: %1\n"
		}
	}
};
